## Terraform Plan Result


### environments/stg/app/launch_template
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.launch_template.aws_launch_template.this will be updated in-place
  ~ resource "aws_launch_template" "this" {
      ~ default_version                      = 14 -> (known after apply)
        id                                   = "lt-0e4f42175cb8fc1e2"
      ~ instance_type                        = "t3.micro" -> "t3.small"
      ~ latest_version                       = 14 -> (known after apply)
        name                                 = "backend-template20251009044338954500000001"
        tags                                 = {}
        # (17 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ launch_template_latest_version = 14 -> (known after apply)
```

### environments/stg/app/asg
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.asg.aws_autoscaling_group.this will be updated in-place
  ~ resource "aws_autoscaling_group" "this" {
      ~ desired_capacity                 = 3 -> 6
        id                               = "stg-asg"
      ~ max_size                         = 5 -> 9
      ~ min_size                         = 3 -> 5
        name                             = "stg-asg"
        # (29 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
<!-- Sticky Pull Request Commentterraform-plan -->